#+title: Release Notes for Sprint 22
#+options: date:nil toc:nil author:nil num:nil
#+todo: ANALYSIS IMPLEMENTATION TESTING | COMPLETED CANCELLED
#+tags: story(s) epic(e) task(t) note(n) spike(p)

* Release Notes

This file contains all stories that were closed during sprint 22.

** Development Stories Implemented

#+begin: clocktable :maxlevel 3 :scope subtree
Clock summary at [2012-12-11 Tue 12:57]

| Headline                                                    | Time    |       |      |
|-------------------------------------------------------------+---------+-------+------|
| *Total time*                                                | *16:24* |       |      |
|-------------------------------------------------------------+---------+-------+------|
| Development Stories Implemented                             |         | 16:24 |      |
| COMPLETED Outputting of floating point numbers rounded      |         |       | 1:00 |
| COMPLETED Vector of double still has floating point issues  |         |       | 0:20 |
| COMPLETED Ignore UML realisation relationship in Dia        |         |       | 0:42 |
| COMPLETED Clocking of agile and build overhead              |         |       | 6:01 |
| COMPLETED Remove unnecessary translation units for services |         |       | 3:29 |
| COMPLETED Add PFH libraries to packages                     |         |       | 4:52 |
#+end:

*** COMPLETED Outputting of floating point numbers rounded            :spike:
    CLOCK: [2012-12-03 Mon 12:07]--[2012-12-03 Mon 13:07] =>  1:00

As reported by JS, numbers coming out of our time series in creris are
incorrectly rounded. This is to do with the default stream settings we
are using when dumping time points. Fix dogen such that we have decent
floating point defaults - if not perfect. This is just a quick hack
for now.

*** COMPLETED Move system model factories into SML                    :story:

We do not have any generator dependencies in the system model
factories so they can safely be moved into SML.

*** COMPLETED Vector of double still has floating point issues        :spike:
    CLOCK: [2012-12-06 Thu 14:15]--[2012-12-06 Thu 14:35] =>  0:20

As reported by JS the previous fix done to time series stopped working
once we refactored the class. This is because dogen is not handling
=std::vector<double>= correctly. Fix the handling of nested names such
that a =bool= or floating point number at any level causes the stream
to format correctly.

*** COMPLETED Ignore UML realisation relationship in Dia              :spike:
    CLOSED: [2012-12-08 Sat 18:42]
    CLOCK: [2012-12-08 Sat 18:00]--[2012-12-08 Sat 18:42] =>  0:42

Treat UML realisation as we treat aggregation - that is allow it to
exist in the diagram without doing any processing to it.

*** COMPLETED Clocking of agile and build overhead                    :story:
    CLOSED: [2012-12-08 Sat 18:42]

This story keeps track of the time spent on stand-up meetings, other
process meetings and the time taken with build checking and fixes, as
well as any hardware/software spike we may have.

**** COMPLETED Build checking and stand-up on 2012-12-03
    CLOCK: [2012-12-03 Mon 06:20]--[2012-12-03 Mon 07:00] =>  0:40

Stand up and build checking.

**** COMPLETED Pascal has a corrupted file system                     :spike:
     CLOCK: [2012-12-03 Mon 11:00]--[2012-12-03 Mon 12:00] =>  1:00

Seems like the forced reboot of pascal over the weekend corrupted the
=E:\= drive. Run a chkdsk on the drive, reboot the box and restart all agents.

**** COMPLETED Lorenz second monitor became primary                   :spike:
     CLOCK: [2012-12-03 Mon 07:52]--[2012-12-03 Mon 09:05] =>  1:13

With the setup of =bell=, the new test machine, it seems the monitors
on lorenz stop behaving. The primary monitor became what was the
secondary monitor. Get everything back to normal.

**** COMPLETED Grooming of release notes across all products           :task:
     CLOCK: [2012-12-03 Mon 13:07]--[2012-12-03 Mon 13:20] =>  0:13

**** COMPLETED Setup new sound card on lorenz                         :story:
    CLOCK: [2012-12-03 Mon 07:00]--[2012-12-03 Mon 07:17] =>  0:17

Try a new sound card on lorenz to see if we can improve demo sound quality.

**** COMPLETED Build checking and stand-up on 2012-12-04
    CLOCK: [2012-12-03 Mon 06:20]--[2012-12-03 Mon 06:50] =>  0:30

Stand up and build checking.

**** COMPLETED Build checking and stand-up on 2012-12-05
     CLOCK: [2012-12-05 Wed 06:20]--[2012-12-05 Wed 06:58] =>  0:38

Stand up and build checking.

**** COMPLETED Build checking and stand-up on 2012-12-07
     CLOCK: [2012-12-07 Fri 06:20]--[2012-12-07 Fri 07:00] =>  0:40

Stand up and build checking.

**** COMPLETED Build checking and stand-up on 2012-12-10
     CLOCK: [2012-12-10 Mon 06:20]--[2012-12-10 Mon 07:10] =>  0:50

Stand up and build checking.

*** COMPLETED Remove unnecessary translation units for services       :spike:
    CLOSED: [2012-12-10 Mon 12:08]
    CLOCK: [2012-12-10 Mon 08:40]--[2012-12-10 Mon 12:09] =>  3:26

At present we are generating all facets for services; however, after
we've spent a lot of time implementing services in Creris, we can
conclude that for now there will be no need for hashing,
serialisation, IO or test data for services. And yet we are paying the
build cost of these empty translation units for no reason. For now, do
not generate any facet other than the domain facet for services.

*** COMPLETED Add PFH libraries to packages                           :story:
    CLOCK: [2012-12-11 Tue 11:38]--[2012-12-11 Tue 12:55] =>  1:17
    CLOCK: [2012-12-11 Tue 10:40]--[2012-12-11 Tue 11:05] =>  0:25
    CLOCK: [2012-12-11 Tue 09:59]--[2012-12-11 Tue 10:40] =>  0:41
    CLOCK: [2012-12-11 Tue 09:18]--[2012-12-11 Tue 09:59] =>  0:41
    CLOCK: [2012-12-11 Tue 07:30]--[2012-12-11 Tue 09:18] =>  1:48

At present our packages on windows and OSX don't run because we are
missing all of the boost, etc dependencies which are not present on
the OS. On linux is luck of the draw, it may or may nor run. We should
just add the dependencies to our packages.

We can do this by simply reading the =PFH_LOCATION= from the
environment and then doing an =install= command with files pointing to
the PFH.

http://www.cmake.org/pipermail/cmake/2009-July/030770.html

For windows we need (according to dependency walker):

- LIBBOOST_PROGRAM_OPTIONS-MGW47-MT-1_49.DLL
- LIBBOOST_FILESYSTEM-MGW47-MT-1_49.DLL
- LIBBOOST_THREAD-MGW47-MT-1_49.DLL
- LIBBOOST_SERIALIZATION-MGW47-MT-1_49.DLL
- LIBBOOST_SYSTEM-MGW47-MT-1_49.DLL
- e:\gtkmm\bin\LIBXML2-2.DLL
- LIBGCC_S_DW2-1.DLL
- LIBSTDC++-6.DLL

** Deprecated Development Stories
